__all__ = ['text_json'] # создаёт из созданного ранее файла новый с данными в формате JSON
__all__ = ['set_user'] # После каждого ввода идентификаторов добавляйте новую информацию в JSON файл
__all__ = ['json2csv'] #сохраняет json файл в формате CSV
__all__ = ['csv2json']
__all__ = ['json_pickle']# ищет json файлы в указанной директории и сохраняет их содержимое в виде одноимённых pickle файлов
__all__ = ['conv_to_csv'] #преобразует pickle файл, хранящий список словарей в табличный csv файл
__all__ = ['print_pickl_str']  # csv файл Распечатайте его как pickle строку
