# Задание №1
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a=23
b="Программирование на python"
c=233.44
print (type(a), '\n', type(b), '\n', type(c))

n = 4
m = 7
print(type(n==m))